challenges/regftr_DoC/app/controllers/gifts_controller.rb

    def index
        puts "=========params========"
        puts params
        puts "=========params========"
        render json: {
            status: 200,
            gifts: Gift.all }
---
SELECT "gifts".* FROM "gifts"

    def show
        puts "=========params========"
        puts params
        puts "=========params========"
        found_gift = Gift.find(params[:id])
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        puts "==========params============="
        puts params
        puts "==========params============="
        puts "==========gift_params============="
        puts gift_params
        puts "==========gift_params============="

        gift = Gift.new(gift_params)

        if gift.save
---
INSERT INTO "gifts" ("description", "value", "event", "gift_giver") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Office Space DVD"], ["value", 4], ["event", "Birthday"], ["gift_giver", "Coworker"]]

    def update
        gift = Gift.find(params[:id])
        gift.update(gift_params)
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "gifts" SET "gift_giver" = $1 WHERE "gifts"."id" = $2  [["gift_giver", "graveSlugPhil"], ["id", 7]]

    def destroy
        gift = Gift.destroy(params[:id])
---
DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 5]]